In [3]:
import numpy as n

In [4]:
import pandas as p

In [5]:
n.random.seed(101)
mydata = n.random.randint(0,101,(4,3)) # creating 2 arrays
mydata

array([[95, 11, 81],
       [70, 63, 87],
       [75,  9, 77],
       [40,  4, 63]])

In [6]:
mi = ['Latvia','Paris','Augsburg','Milan']
mc = ['La','Fr','Ge']

In [7]:
df = p.DataFrame(data=mydata,index=mi,columns=mc)
df

          La  Fr  Ge
Latvia    95  11  81
Paris     70  63  87
Augsburg  75   9  77
Milan     40   4  63

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, Latvia to Milan
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   La      4 non-null      int64
 1   Fr      4 non-null      int64
 2   Ge      4 non-null      int64
dtypes: int64(3)
memory usage: 128.0+ bytes

In [9]:
pwd

'/Users/ka53/Desktop/ml-practice/pandas'

In [10]:
ls

dataframe.ipynb  series.ipynb

In [11]:
df = p.read_csv('/Users/ka53/Desktop/ml/Notebooks ML Rus V10/DATA/tips.csv')

In [12]:
df

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251
...,...,...,...,...,...,...,...,...,...,...,...
239,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842,Sat2657
240,27.18,2.00,Female,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404,Sat1766
241,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196,Sat3880
242,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950,Sat17
243,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139,Thur672

In [13]:
df.columns # checking columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size',
       'price_per_person', 'Payer Name', 'CC Number', 'Payment ID'],
      dtype='object')

In [14]:
df.index

RangeIndex(start=0, stop=244, step=1)

In [15]:
df.head(10) # first 10 rows

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251
5,25.29,4.71,Male,No,Sun,Dinner,4,6.32,Erik Smith,213140353657882,Sun9679
6,8.77,2.00,Male,No,Sun,Dinner,2,4.38,Kristopher Johnson,2223727524230344,Sun5985
7,26.88,3.12,Male,No,Sun,Dinner,4,6.72,Robert Buck,3514785077705092,Sun8157
8,15.04,1.96,Male,No,Sun,Dinner,2,7.52,Joseph Mcdonald,3522866365840377,Sun6820
9,14.78,3.23,Male,No,Sun,Dinner,2,7.39,Jerome Abbott,3532124519049786,Sun3775

In [16]:
df.tail(5) # last five in rows

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
239,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842,Sat2657
240,27.18,2.00,Female,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404,Sat1766
241,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196,Sat3880
242,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950,Sat17
243,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139,Thur672

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 11 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   total_bill        244 non-null    float64
 1   tip               244 non-null    float64
 2   sex               244 non-null    object
 3   smoker            244 non-null    object
 4   day               244 non-null    object
 5   time              244 non-null    object
 6   size              244 non-null    int64
 7   price_per_person  244 non-null    float64
 8   Payer Name        244 non-null    object
 9   CC Number         244 non-null    int64
 10  Payment ID        244 non-null    object
dtypes: float64(3), int64(2), object(6)
memory usage: 21.1+ KB

In [27]:
df.describe()

       total_bill         tip        size  price_per_person     CC Number
count  244.000000  244.000000  244.000000        244.000000  2.440000e+02
mean    19.785943    2.998279    2.569672          7.888197  2.563496e+15
std      8.902412    1.383638    0.951100          2.914234  2.369340e+15
min      3.070000    1.000000    1.000000          2.880000  6.040679e+10
25%     13.347500    2.000000    2.000000          5.800000  3.040731e+13
50%     17.795000    2.900000    2.000000          7.255000  3.525318e+15
75%     24.127500    3.562500    3.000000          9.390000  4.553675e+15
max     50.810000   10.000000    6.000000         20.270000  6.596454e+15

In [31]:
df.describe().transpose()

,count,mean,std,min,25%,50%,75%,max
total_bill,244.0,1.978594e+01,8.902412e+00,3.070000e+00,1.334750e+01,1.779500e+01,2.412750e+01,5.081000e+01
tip,244.0,2.998279e+00,1.383638e+00,1.000000e+00,2.000000e+00,2.900000e+00,3.562500e+00,1.000000e+01
size,244.0,2.569672e+00,9.510998e-01,1.000000e+00,2.000000e+00,2.000000e+00,3.000000e+00,6.000000e+00
price_per_person,244.0,7.888197e+00,2.914234e+00,2.880000e+00,5.800000e+00,7.255000e+00,9.390000e+00,2.027000e+01
CC Number,244.0,2.563496e+15,2.369340e+15,6.040679e+10,3.040731e+13,3.525318e+15,4.553675e+15,6.596454e+15

In [32]:
df.head(6)

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251
5,25.29,4.71,Male,No,Sun,Dinner,4,6.32,Erik Smith,213140353657882,Sun9679

In [35]:
df['price_per_person'].head(6)

0     8.49
1     3.45
2     7.00
3    11.84
4     6.15
5     6.32
Name: price_per_person, dtype: float64

In [37]:
df[['sex','time']].head(3)

      sex    time
0  Female  Dinner
1    Male  Dinner
2    Male  Dinner

In [18]:
100 * df['tip'].head(3) / df['total_bill'].head(3) # calculating

0     5.944673
1    16.054159
2    16.658734
dtype: float64

In [34]:
df['tp'] = 100 * df['tip'] / df['total_bill'] # adding new column

In [20]:
df.head(10)

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,tp
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959,5.944673
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608,16.054159
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458,16.658734
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260,13.978041
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251,14.680765
5,25.29,4.71,Male,No,Sun,Dinner,4,6.32,Erik Smith,213140353657882,Sun9679,18.623962
6,8.77,2.00,Male,No,Sun,Dinner,2,4.38,Kristopher Johnson,2223727524230344,Sun5985,22.805017
7,26.88,3.12,Male,No,Sun,Dinner,4,6.72,Robert Buck,3514785077705092,Sun8157,11.607143
8,15.04,1.96,Male,No,Sun,Dinner,2,7.52,Joseph Mcdonald,3522866365840377,Sun6820,13.031915
9,14.78,3.23,Male,No,Sun,Dinner,2,7.39,Jerome Abbott,3532124519049786,Sun3775,21.853857

In [38]:
df['tp'] = n.round(df['tip']/ df['total_bill'],2)

In [37]:
df.head()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,tp,tip-percent
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959,0.06,0.06
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608,0.16,0.16
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458,0.17,0.17
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260,0.14,0.14
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251,0.15,0.15

In [39]:
df.shape

(244, 13)

In [47]:
df.drop('tp', axis=1)
df.drop('tip-percent',axis=1)

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,tp
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959,0.06
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608,0.16
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458,0.17
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260,0.14
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251,0.15
...,...,...,...,...,...,...,...,...,...,...,...,...
239,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842,Sat2657,0.20
240,27.18,2.00,Female,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404,Sat1766,0.07
241,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196,Sat3880,0.09
242,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950,Sat17,0.10
243,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139,Thur672,0.16

In [ ]:
#

In [48]:
df.head()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,tp,tip-percent
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959,0.06,0.06
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608,0.16,0.16
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458,0.17,0.17
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260,0.14,0.14
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251,0.15,0.15

In [49]:
df = df.drop(columns=['tp'])

In [50]:
df.head()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,tip-percent
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959,0.06
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608,0.16
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458,0.17
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260,0.14
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251,0.15

In [51]:
df = df.drop(columns=['tip-percent'])

In [52]:
df.head()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251

In [ ]:
# LINES

In [54]:
df.index

RangeIndex(start=0, stop=244, step=1)

In [59]:
df.set_index('sex') # transform to index variable = 'sex' , but it will not save

,total_bill,tip,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
sex,,,,,,,,,,
Female,16.99,1.01,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
Male,10.34,1.66,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
Male,21.01,3.50,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
Male,23.68,3.31,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
Female,24.59,3.61,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251
...,...,...,...,...,...,...,...,...,...,...
Male,29.03,5.92,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842,Sat2657
Female,27.18,2.00,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404,Sat1766
Male,22.67,2.00,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196,Sat3880
Male,17.82,1.75,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950,Sat17
Female,18.78,3.00,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139,Thur672

In [60]:
df.head()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251

In [61]:
df = df.set_index('sex') # know we saved it , we can save only ones , after it will be error

In [62]:
df.head()

,total_bill,tip,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
sex,,,,,,,,,,
Female,16.99,1.01,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
Male,10.34,1.66,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
Male,21.01,3.50,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
Male,23.68,3.31,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
Female,24.59,3.61,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251

In [63]:
df.reset_index() # without parameters , but without saving

,sex,total_bill,tip,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,Female,16.99,1.01,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,Male,10.34,1.66,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,Male,21.01,3.50,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,Male,23.68,3.31,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
4,Female,24.59,3.61,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251
...,...,...,...,...,...,...,...,...,...,...,...
239,Male,29.03,5.92,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842,Sat2657
240,Female,27.18,2.00,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404,Sat1766
241,Male,22.67,2.00,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196,Sat3880
242,Male,17.82,1.75,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950,Sat17
243,Female,18.78,3.00,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139,Thur672

In [64]:
df.head()

,total_bill,tip,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
sex,,,,,,,,,,
Female,16.99,1.01,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
Male,10.34,1.66,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
Male,21.01,3.50,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
Male,23.68,3.31,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
Female,24.59,3.61,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251

In [65]:
df = df.reset_index() # now we saved it

In [66]:
df.head()

,sex,total_bill,tip,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,Female,16.99,1.01,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,Male,10.34,1.66,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,Male,21.01,3.50,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,Male,23.68,3.31,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
4,Female,24.59,3.61,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251

In [67]:
df = df.set_index('sex') # we add again variables 'sex' to column

In [68]:
df.head()

,total_bill,tip,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
sex,,,,,,,,,,
Female,16.99,1.01,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
Male,10.34,1.66,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
Male,21.01,3.50,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
Male,23.68,3.31,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
Female,24.59,3.61,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251

In [72]:
df.iloc[0] # how to get individual line

total_bill                       16.99
tip                               1.01
smoker                              No
day                                Sun
time                            Dinner
size                                 2
price_per_person                  8.49
Payer Name          Christy Cunningham
CC Number             3560325168603410
Payment ID                     Sun2959
Name: Female, dtype: object

In [77]:
df.loc['Male'] # we can get only what in column , so only variable = 'sex'

,total_bill,tip,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
sex,,,,,,,,,,
Male,10.34,1.66,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
Male,21.01,3.50,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
Male,23.68,3.31,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
Male,25.29,4.71,No,Sun,Dinner,4,6.32,Erik Smith,213140353657882,Sun9679
Male,8.77,2.00,No,Sun,Dinner,2,4.38,Kristopher Johnson,2223727524230344,Sun5985
...,...,...,...,...,...,...,...,...,...,...
Male,12.60,1.00,Yes,Sat,Dinner,2,6.30,Matthew Myers,3543676378973965,Sat5032
Male,32.83,1.17,Yes,Sat,Dinner,2,16.42,Thomas Brown,4284722681265508,Sat2929
Male,29.03,5.92,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842,Sat2657
Male,22.67,2.00,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196,Sat3880
Male,17.82,1.75,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950,Sat17

In [ ]:
# i need to remove 'sex' , and put 'tip'

In [78]:
df = df.reset_index('sex')

In [79]:
df.head()

,sex,total_bill,tip,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,Female,16.99,1.01,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,Male,10.34,1.66,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,Male,21.01,3.50,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,Male,23.68,3.31,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
4,Female,24.59,3.61,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251

In [81]:
df = df.set_index('tip')

In [82]:
df.head()

,sex,total_bill,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
tip,,,,,,,,,,
1.01,Female,16.99,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1.66,Male,10.34,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
3.50,Male,21.01,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3.31,Male,23.68,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
3.61,Female,24.59,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251

In [83]:
df.iloc[0]

sex                             Female
total_bill                       16.99
smoker                              No
day                                Sun
time                            Dinner
size                                 2
price_per_person                  8.49
Payer Name          Christy Cunningham
CC Number             3560325168603410
Payment ID                     Sun2959
Name: 1.01, dtype: object

In [85]:
df.loc[1.01]

sex                             Female
total_bill                       16.99
smoker                              No
day                                Sun
time                            Dinner
size                                 2
price_per_person                  8.49
Payer Name          Christy Cunningham
CC Number             3560325168603410
Payment ID                     Sun2959
Name: 1.01, dtype: object

In [86]:
df.loc[4.00]

,sex,total_bill,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
tip,,,,,,,,,,
4.0,Male,27.20,No,Thur,Lunch,4,6.80,John Davis,30344778738589,Thur4924
4.0,Male,18.28,No,Thur,Lunch,2,9.14,Donald Williams,5363745772301404,Thur3636
4.0,Male,27.28,Yes,Fri,Dinner,2,13.64,Eric Carter,4563054452787961,Fri3159
4.0,Female,14.31,Yes,Sat,Dinner,2,7.16,Amanda Anderson,375638820334211,Sat2614
4.0,Male,38.07,No,Sun,Dinner,3,12.69,Jeff Lopez,3572865915176463,Sun591
4.0,Female,25.71,No,Sun,Dinner,3,8.57,Katie Smith,5400160161311292,Sun6492
4.0,Male,16.82,Yes,Sun,Dinner,2,8.41,Brian Miles,3586342145399277,Sun7621
4.0,Female,9.60,Yes,Sun,Dinner,2,4.80,Melanie Gray,4211808859168,Sun4598
4.0,Male,23.10,Yes,Sun,Dinner,3,7.70,Richard Stevens,3560193117506187,Sun1821
4.0,Male,16.58,Yes,Thur,Lunch,2,8.29,Benjamin Weber,676210011505,Thur9318
4.0,Male,18.71,Yes,Thur,Lunch,3,6.24,Jason Conrad,4581233003487,Thur6048
4.0,Male,20.53,Yes,Thur,Lunch,4,5.13,Scott Kim,3570611756827620,Thur2160

In [88]:
df.loc[[1,5]] # looking for 2 tips 'one' and 'five'

,sex,total_bill,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
tip,,,,,,,,,,
1.0,Female,3.07,Yes,Sat,Dinner,1,3.07,Tiffany Brock,4359488526995267,Sat3455
1.0,Female,5.75,Yes,Fri,Dinner,2,2.88,Leah Ramirez,3508911676966392,Fri3780
1.0,Female,7.25,No,Sat,Dinner,1,7.25,Terri Jones,3559221007826887,Sat4801
1.0,Male,12.60,Yes,Sat,Dinner,2,6.30,Matthew Myers,3543676378973965,Sat5032
5.0,Female,35.26,No,Sun,Dinner,4,8.82,Diane Macias,4577817359320969,Sun6686
5.0,Male,31.27,No,Sat,Dinner,3,10.42,Mr. Brandon Berry,6011525851069856,Sat6373
5.0,Male,22.23,No,Sun,Dinner,2,11.12,Joshua Gilmore,4292072734899,Sun7097
5.0,Female,25.28,Yes,Sat,Dinner,2,12.64,Julie Holmes,5418689346409571,Sat6065
5.0,Male,32.68,Yes,Thur,Lunch,2,16.34,Daniel Murphy,5356177501009133,Thur8801
5.0,Male,41.19,No,Thur,Lunch,5,8.24,Eric Andrews,4356531761046453,Thur3621
5.0,Female,27.05,No,Thur,Lunch,6,4.51,Regina Jones,4311048695487,Thur6179
5.0,Male,48.17,No,Sun,Dinner,6,8.03,Ryan Gonzales,3523151482063321,Sun7518
5.0,Male,20.69,No,Sun,Dinner,5,4.14,Joseph Howell,30362407455623,Sun5842
5.0,Female,43.11,Yes,Thur,Lunch,4,10.78,Brooke Soto,5544902205760175,Thur9313

In [89]:
df.loc[1.01]

sex                             Female
total_bill                       16.99
smoker                              No
day                                Sun
time                            Dinner
size                                 2
price_per_person                  8.49
Payer Name          Christy Cunningham
CC Number             3560325168603410
Payment ID                     Sun2959
Name: 1.01, dtype: object

In [91]:
df.drop(1.01) # deleting from variable = 'tip' 1.01 , but we did not save it

,sex,total_bill,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
tip,,,,,,,,,,
1.66,Male,10.34,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
3.50,Male,21.01,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3.31,Male,23.68,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
3.61,Female,24.59,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251
4.71,Male,25.29,No,Sun,Dinner,4,6.32,Erik Smith,213140353657882,Sun9679
...,...,...,...,...,...,...,...,...,...,...
5.92,Male,29.03,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842,Sat2657
2.00,Female,27.18,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404,Sat1766
2.00,Male,22.67,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196,Sat3880
1.75,Male,17.82,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950,Sat17
3.00,Female,18.78,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139,Thur672

In [92]:
df.head()

,sex,total_bill,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
tip,,,,,,,,,,
1.01,Female,16.99,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1.66,Male,10.34,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
3.50,Male,21.01,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3.31,Male,23.68,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
3.61,Female,24.59,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251

In [93]:
one_row = df.iloc[0]

In [94]:
one_row

sex                             Female
total_bill                       16.99
smoker                              No
day                                Sun
time                            Dinner
size                                 2
price_per_person                  8.49
Payer Name          Christy Cunningham
CC Number             3560325168603410
Payment ID                     Sun2959
Name: 1.01, dtype: object

In [95]:
df.head()

,sex,total_bill,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
tip,,,,,,,,,,
1.01,Female,16.99,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1.66,Male,10.34,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
3.50,Male,21.01,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3.31,Male,23.68,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
3.61,Female,24.59,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251

In [98]:
p.concat([df,p.DataFrame([one_row])]) # adding new row

,sex,total_bill,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
1.01,Female,16.99,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1.66,Male,10.34,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
3.50,Male,21.01,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3.31,Male,23.68,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
3.61,Female,24.59,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251
...,...,...,...,...,...,...,...,...,...,...
2.00,Female,27.18,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404,Sat1766
2.00,Male,22.67,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196,Sat3880
1.75,Male,17.82,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950,Sat17
3.00,Female,18.78,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139,Thur672
1.01,Female,16.99,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959